
// 1.დაწერე პროგრამა, რომელიც დაბეჭდავს 1-დან 100-მდე ციფრებს For ციკლის გამოყენებით.

/*

for (int i = 1; i < 101; i++)
{
    Console.WriteLine(i);
}

*/


// 2.დაწერე პროგრამა, რომელიც For ციკლის გამოყენებით დაბეჭდავს ყველა ლუწ რიცხვს 1-დან 50-მდე.

/*

for (int i = 1; i < 51; i++)
{
    if ( i % 2 == 0)
    {
        Console.WriteLine(i);
    }
}

*/


////სავარჯიშო 4: ჩადგმული (Nested) ციკლები
//დაწერე პროგრამა, რომელიც დაბეჭდავს ვარსკვლავების (*) სამკუთხედს შემდეგი ფორმით:
//★ 
//★★ 
//★★★ 
//★★★★ 
//★★★★★

/*

int i;
int j;

for (i = 0; i < 5; i++)
{

    for (j = 0; j < i; j++)
    {
        Console.Write("*");
    }
    Console.WriteLine("*");

}

*/


//სავარჯიშო 5: ციკლი და პირობა (if)
//დაწერე პროგრამა, რომელიც For ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 100-მდე, მაგრამ:
//თუ რიცხვი იყოფა 3-ზე, დაბეჭდოს "Fizz"
//თუ რიცხვი იყოფა 5-ზე, დაბეჭდოს "Buzz"
//თუ რიცხვი იყოფა 3-სა და 5-ზე ერთდროულად, დაბეჭდოს "FizzBuzz"

/*

for (int i = 0; i <= 100; i++)
{
    Console.WriteLine(i);
    if (i % 3 == 0)
    {
        Console.Write("Fizz");
    }
    else if (i % 5 == 0)
    {
        Console.Write("Buzz");
    }
    else if (i % 3 == 0 && i % 5 == 0)
    {
        Console.Write("FizzBuzz");
    }
}

*/



